# StructuralBottomReleaseFx Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralBottomReleaseFx Property
ParameterTypeId Class See Also
---
"Base Fx"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralBottomReleaseFx { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralBottomReleaseFx As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralBottomReleaseFx {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace